<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Use-a-python-module-containing-datasets-as-a-source-from-the-iris-data.-Create-a-pandas-dataframe,-df_iris,-from-this-data." data-toc-modified-id="Use-a-python-module-containing-datasets-as-a-source-from-the-iris-data.-Create-a-pandas-dataframe,-df_iris,-from-this-data.-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Use a python module containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.</a></span><ul class="toc-item"><li><span><a href="#Print-the-first-3-rows" data-toc-modified-id="Print-the-first-3-rows-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Print the first 3 rows</a></span></li><li><span><a href="#Print-the-number-of-rows-and-columns-(shape)" data-toc-modified-id="Print-the-number-of-rows-and-columns-(shape)-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Print the number of rows and columns (shape)</a></span></li><li><span><a href="#Print-the-column-names" data-toc-modified-id="Print-the-column-names-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Print the column names</a></span></li><li><span><a href="#Print-the-data-type-of-each-column" data-toc-modified-id="Print-the-data-type-of-each-column-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Print the data type of each column</a></span></li><li><span><a href="#Print-the-summary-statistics-for-each-of-the-numeric-variables." data-toc-modified-id="Print-the-summary-statistics-for-each-of-the-numeric-variables.-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Print the summary statistics for each of the numeric variables.</a></span></li><li><span><a href="#We-can-get-the-Iris-dataset-from-other-sources-as-well..." data-toc-modified-id="We-can-get-the-Iris-dataset-from-other-sources-as-well...-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>We can get the Iris dataset from other sources as well...</a></span></li></ul></li><li><span><a href="#Read-Table1_CustDetails-the-excel-module-dataset,-Excel_Exercises.xlsx,-into-a-dataframe,-df_excel" data-toc-modified-id="Read-Table1_CustDetails-the-excel-module-dataset,-Excel_Exercises.xlsx,-into-a-dataframe,-df_excel-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel</a></span><ul class="toc-item"><li><span><a href="#Assign-the-first-100-rows-to-a-new-dataframe,-df_excel_sample" data-toc-modified-id="Assign-the-first-100-rows-to-a-new-dataframe,-df_excel_sample-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Assign the first 100 rows to a new dataframe, df_excel_sample</a></span></li><li><span><a href="#Print-the-number-of-rows-of-your-original-dataframe" data-toc-modified-id="Print-the-number-of-rows-of-your-original-dataframe-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Print the number of rows of your original dataframe</a></span></li><li><span><a href="#Print-the-first-5-column-names" data-toc-modified-id="Print-the-first-5-column-names-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Print the first 5 column names</a></span></li><li><span><a href="#Print-the-column-names-that-have-a-data-type-of-object" data-toc-modified-id="Print-the-column-names-that-have-a-data-type-of-object-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Print the column names that have a data type of object</a></span></li><li><span><a href="#Compute-the-range-for-each-of-the-numeric-variables." data-toc-modified-id="Compute-the-range-for-each-of-the-numeric-variables.-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Compute the range for each of the numeric variables.</a></span></li><li><span><a href="#Compute-the-range-for-each-of-the-numeric-variables." data-toc-modified-id="Compute-the-range-for-each-of-the-numeric-variables.-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>Compute the range for each of the numeric variables.</a></span></li></ul></li><li><span><a href="#Read-the-data-from-this-google-sheet-into-a-dataframe,-df_google" data-toc-modified-id="Read-the-data-from-this-google-sheet-into-a-dataframe,-df_google-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Read the data from this google sheet into a dataframe, df_google</a></span><ul class="toc-item"><li><span><a href="#Print-the-first-3-rows" data-toc-modified-id="Print-the-first-3-rows-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Print the first 3 rows</a></span></li><li><span><a href="#Print-the-column-names" data-toc-modified-id="Print-the-column-names-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Print the column names</a></span></li><li><span><a href="#Print-the-data-type-of-each-column" data-toc-modified-id="Print-the-data-type-of-each-column-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Print the data type of each column</a></span></li><li><span><a href="#Print-the-summary-statistics-for-each-of-the-numeric-variables" data-toc-modified-id="Print-the-summary-statistics-for-each-of-the-numeric-variables-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Print the summary statistics for each of the numeric variables</a></span></li><li><span><a href="#Print-the-unique-values-for-each-of-your-categorical-variables" data-toc-modified-id="Print-the-unique-values-for-each-of-your-categorical-variables-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>Print the unique values for each of your categorical variables</a></span></li></ul></li></ul></div>

In [2]:
import pandas as pd
import numpy as np

from pydataset import data

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns


# ignore warnings
import warnings
warnings.filterwarnings("ignore")

from env import host, user, password

## Use a python module containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [3]:
data('iris', show_doc=True)

iris

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Edgar Anderson's Iris Data

### Description

This famous (Fisher's or Anderson's) iris data set gives the measurements in
centimeters of the variables sepal length and width and petal length and
width, respectively, for 50 flowers from each of 3 species of iris. The
species are _Iris setosa_, _versicolor_, and _virginica_.

### Usage

    iris
    iris3

### Format

`iris` is a data frame with 150 cases (rows) and 5 variables (columns) named
`Sepal.Length`, `Sepal.Width`, `Petal.Length`, `Petal.Width`, and `Species`.

`iris3` gives the same data arranged as a 3-dimensional array of size 50 by 4
by 3, as represented by S-PLUS. The first dimension gives the case number
within the species subsample, the second the measurements with names `Sepal
L.`, `Sepal W.`, `Petal L.`, and `Petal W.`, and the third the species.

### Source

Fisher, R. A. (1936) The use of multiple measurements in taxonomic problems.
_Annals of Eugenics_, **7**, Part II, 179–188.

The data were collected by Anderson, Edgar (1935). The irises of the Gaspe
Peninsula, _Bulletin of the American Iris Society_, **59**, 2–5.

### References

Becker, R. A., Chambers, J. M. and Wilks, A. R. (1988) _The New S Language_.
Wadsworth & Brooks/Cole. (has `iris3` as `iris`.)

### See Also

`matplot` some examples of which use `iris`.

### Examples

    dni3 <- dimnames(iris3)
    ii <- data.frame(matrix(aperm(iris3, c(1,3,2)), ncol = 4,
                            dimnames = list(NULL, sub(" L.",".Length",
                                            sub(" W.",".Width", dni3[[2]])))),
        Species = gl(3, 50, labels = sub("S", "s", sub("V", "v", dni3[[3]]))))
    all.equal(ii, iris) # TRUE

In [5]:
df_iris = data('iris')

### Print the first 3 rows

In [6]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

### Print the number of rows and columns (shape)

In [7]:
df_iris.shape

(150, 5)

### Print the column names

In [9]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [10]:
# You might want to clean up the column names at this point. Up to you.

df_iris.columns = df_iris.columns.str.replace('.', '_').str.lower()
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [11]:
# This is a nice way to get the column names in a list, but you could do df_iris.columns alone, too.

df_iris.columns.tolist()

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

### Print the data type of each column

In [12]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [13]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

### Print the summary statistics for each of the numeric variables. 

**Would you recommend rescaling the data based on these statistics?**

**<font color=purple>- In the documentation, we see that all of the numeric columns are measured in cm, so I don't see a reason that we would need to rescale the df.</font>**

In [14]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### We can get the Iris dataset from other sources as well...

**<font color=purple>For example, from Seaborn</font>**

In [15]:
# Using Seaborn Datasets

iris = sns.load_dataset('iris')
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

**<font color=purple>From Sklearn you can get a dictionary-like object with the data ready to use in a DataFrame.</font>**

In [16]:
# Using Sklearn Datasets, dictionary-like object

from sklearn import datasets

iris = datasets.load_iris()
type(iris)

sklearn.utils.Bunch

In [17]:
iris.keys()

dict_keys(['data', 'target', 'target_names', 'DESCR', 'feature_names', 'filename'])

In [19]:
# Create the DataFrame using 'data' and name the columns using 'feature_names'

iris_df = pd.DataFrame(iris.data, columns=iris.feature_names)
iris_df.head(3)

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2

In [20]:
# Add the target variable, species, using 'target'. Here we get our target as a number!

iris_df['species'] = iris.target
iris_df.head(3)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0

In [28]:
# You may want to clean up the column names, but you may want to leave them intact for use in viz

iris_df.columns = iris_df.columns.str.replace(' \(cm\)', '').str.replace(' ', '_')
iris_df.columns.tolist()

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

**Other Seaborn Datasets you can use are linked [here](https://github.com/mwaskom/seaborn-data)**

**More on sklearn dataset loading utilities [here](https://scikit-learn.org/stable/datasets/index.html)**

## Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [98]:
customers_df = pd.read_excel('my_telco_churn.xlsx', sheet_name='Table2_CustDetails')
customers_df.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,tenure,churn
0,7569-NMZYQ,Female,0,Yes,Yes,2,2,2,Bank transfer (automatic),118.75,8672.45,73.031158,No
1,8984-HPEMB,Female,0,No,No,2,2,2,Electronic check,118.65,8477.60,71.450485,No
2,5734-EJKXG,Female,0,No,No,2,2,1,Electronic check,118.60,7365.70,62.105396,No

### Assign the first 100 rows to a new dataframe, df_excel_sample

In [99]:
df_excel_sample = customers_df.head(100)
df_excel_sample.shape

(100, 13)

### Print the number of rows of your original dataframe

In [100]:
customers_df.shape[0]

7049

### Print the first 5 column names

In [101]:
customers_df.columns.tolist()[:5]

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

###  Print the column names that have a data type of object

In [102]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 13 columns):
customer_id          7043 non-null object
gender               7049 non-null object
is_senior_citizen    7049 non-null int64
partner              7049 non-null object
dependents           7049 non-null object
phone_service        7049 non-null int64
internet_service     7049 non-null int64
contract_type        7049 non-null int64
payment_type         7049 non-null object
monthly_charges      7049 non-null float64
total_charges        7038 non-null float64
tenure               7049 non-null float64
churn                7049 non-null object
dtypes: float64(3), int64(4), object(6)
memory usage: 716.0+ KB

In [103]:
for col in customers_df:
    if customers_df[col].dtype == 'O':
        print(col)

customer_id
gender
partner
dependents
payment_type
churn

In [91]:
# Leave the loops in the 80s and do it with a list comprehension!

[col for col in customers_df if customers_df[col].dtype == 'O']

['customer_id',
 'gender',
 'partner',
 'dependents',
 'phone_desc',
 'internet_desc',
 'contract_desc',
 'payment_type',
 'churn']

In [90]:
# .select_dtypes(object) works on the whole df

customers_df.select_dtypes(object).columns.tolist()

['customer_id',
 'gender',
 'partner',
 'dependents',
 'phone_desc',
 'internet_desc',
 'contract_desc',
 'payment_type',
 'churn']

### Compute the range for each of the numeric variables.

In [92]:
customers_df.head(1)

,customer_id,gender,is_senior_citizen,partner,dependents,partner_dependents,phone_desc,phone_service,internet_desc,internet_service,...,avg_monthly_charges,charges_correct,today,tenure_in_days,start_date,is_female,has_churned,has_phone,has_internet,churn
0,3217-FZDMN,Female,1,No,No,0,One Line,1,Fiber Optic,2,...,94.45,1.0,43705,239,43466,True,True,True,True,Yes

In [97]:
customers_df.select_dtypes(['int64', 'float64']).describe()

,partner_dependents,monthly_charges,total_charges,tenure,avg_monthly_charges,today,tenure_in_days,start_date
count,7044.000000,7044.000000,7033.00000,7044.000000,7033.000000,7044.0,7044.000000,7044.000000
mean,1.083191,64.747913,2283.09658,32.378946,64.784402,43705.0,984.288756,42720.711244
std,1.226757,30.108356,2266.86146,24.593839,30.104331,0.0,747.696079,747.696079
min,0.000000,18.250000,18.80000,0.000000,18.250000,43705.0,0.000000,41293.000000
25%,0.000000,35.450000,401.50000,8.725343,35.500000,43705.0,265.000000,42026.000000
50%,1.000000,70.350000,1396.90000,28.714373,70.350000,43705.0,873.000000,42832.000000
75%,2.000000,89.850000,3794.50000,55.226148,89.900000,43705.0,1679.000000,43440.000000
max,3.000000,118.750000,8684.80000,79.341772,118.750000,43705.0,2412.000000,43705.000000

## Read the data from this google sheet into a dataframe, df_google

In [29]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

In [30]:
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [31]:
df_googlesheet = pd.read_csv(csv_export_url)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### Print the first 3 rows

In [32]:
df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### Print the column names

In [33]:
df_googlesheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [34]:
df_googlesheet.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

### Print the data type of each column

In [35]:
df_googlesheet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [36]:
df_googlesheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Print the summary statistics for each of the numeric variables

In [37]:
df_googlesheet.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Print the unique values for each of your categorical variables

In [72]:
df_googlesheet.Name.value_counts(dropna=False)

Ali, Mr. William                1
McGowan, Miss. Anna "Annie"     1
Olsen, Mr. Ole Martin           1
McEvoy, Mr. Michael             1
Klaber, Mr. Herman              1
                               ..
Allison, Miss. Helen Loraine    1
Duran y More, Miss. Asuncion    1
Slayter, Miss. Hilda Mary       1
Osman, Mrs. Mara                1
Gustafsson, Mr. Johan Birger    1
Name: Name, Length: 891, dtype: int64

In [71]:
df_googlesheet.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [73]:
df_googlesheet.Ticket.value_counts(dropna=False)

1601            7
347082          7
CA. 2343        7
3101295         6
347088          6
               ..
3460            1
C.A. 17248      1
C.A. 29395      1
F.C.C. 13531    1
315151          1
Name: Ticket, Length: 681, dtype: int64

In [74]:
df_googlesheet.Cabin.value_counts(dropna=False)

NaN                687
B96 B98              4
G6                   4
C23 C25 C27          4
D                    3
F2                   3
C22 C26              3
F33                  3
E101                 3
E33                  2
B5                   2
D36                  2
C65                  2
C2                   2
B77                  2
C78                  2
D17                  2
C83                  2
C126                 2
B58 B60              2
B22                  2
B49                  2
C125                 2
E121                 2
E24                  2
B51 B53 B55          2
B20                  2
E8                   2
C123                 2
D20                  2
C52                  2
B18                  2
E67                  2
C92                  2
B28                  2
C93                  2
E25                  2
D33                  2
C68                  2
B35                  2
D35                  2
E44                  2
B57 B59 B63 B66      2
C124                 2
F G73                2
D26                  2
F4                   2
B38                  1
C99                  1
C46                  1
A7                   1
E12                  1
D47                  1
C87                  1
C32                  1
C85                  1
A24                  1
E36                  1
D30                  1
C103                 1
C82                  1
D9                   1
B71                  1
C110                 1
E49                  1
D56                  1
D10 D12              1
C104                 1
E40                  1
C45                  1
E17                  1
D50                  1
E50                  1
A19                  1
A23                  1
B80                  1
D28                  1
D19                  1
D37                  1
C90                  1
B78                  1
C70                  1
A32                  1
E58                  1
E38                  1
E77                  1
C54                  1
B39                  1
C95                  1
D7                   1
A5                   1
C148                 1
A14                  1
E63                  1
D15                  1
B79                  1
D46                  1
B69                  1
A6                   1
C7                   1
B86                  1
B101                 1
F E69                1
A36                  1
B4                   1
C128                 1
F G63                1
B19                  1
E31                  1
E10                  1
A10                  1
C30                  1
D48                  1
A31                  1
C118                 1
B50                  1
B37                  1
A34                  1
A20                  1
C49                  1
C91                  1
C101                 1
C106                 1
E34                  1
C111                 1
B30                  1
D11                  1
D45                  1
C86                  1
T                    1
D49                  1
D21                  1
B73                  1
D6                   1
B102                 1
E46                  1
B82 B84              1
A26                  1
A16                  1
C50                  1
B3                   1
C62 C64              1
B41                  1
C47                  1
E68                  1
B42                  1
F38                  1
B94                  1
Name: Cabin, dtype: int64

In [75]:
df_googlesheet.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

**<font color=purple>How about a quick function?</font>**

In [77]:
def cat_uniques(df):
    for col in df:
        if df[col].dtype == 'O':
            print(col)
            print('-------------')
            print(df[col].value_counts(dropna=False))
            print('-------------')

In [79]:
cat_uniques(df_googlesheet)

Name
-------------
Ali, Mr. William                1
McGowan, Miss. Anna "Annie"     1
Olsen, Mr. Ole Martin           1
McEvoy, Mr. Michael             1
Klaber, Mr. Herman              1
                               ..
Allison, Miss. Helen Loraine    1
Duran y More, Miss. Asuncion    1
Slayter, Miss. Hilda Mary       1
Osman, Mrs. Mara                1
Gustafsson, Mr. Johan Birger    1
Name: Name, Length: 891, dtype: int64
-------------
Sex
-------------
male      577
female    314
Name: Sex, dtype: int64
-------------
Ticket
-------------
1601            7
347082          7
CA. 2343        7
3101295         6
347088          6
               ..
3460            1
C.A. 17248      1
C.A. 29395      1
F.C.C. 13531    1
315151          1
Name: Ticket, Length: 681, dtype: int64
-------------
Cabin
-------------
NaN                687
B96 B98              4
G6                   4
C23 C25 C27          4
D                    3
F2                   3
C22 C26              3
F33                  3
E101                 3
E33                  2
B5                   2
D36                  2
C65                  2
C2                   2
B77                  2
C78                  2
D17                  2
C83                  2
C126                 2
B58 B60              2
B22                  2
B49                  2
C125                 2
E121                 2
E24                  2
B51 B53 B55          2
B20                  2
E8                   2
C123                 2
D20                  2
C52                  2
B18                  2
E67                  2
C92                  2
B28                  2
C93                  2
E25                  2
D33                  2
C68                  2
B35                  2
D35                  2
E44                  2
B57 B59 B63 B66      2
C124                 2
F G73                2
D26                  2
F4                   2
B38                  1
C99                  1
C46                  1
A7                   1
E12                  1
D47                  1
C87                  1
C32                  1
C85                  1
A24                  1
E36                  1
D30                  1
C103                 1
C82                  1
D9                   1
B71                  1
C110                 1
E49                  1
D56                  1
D10 D12              1
C104                 1
E40                  1
C45                  1
E17                  1
D50                  1
E50                  1
A19                  1
A23                  1
B80                  1
D28                  1
D19                  1
D37                  1
C90                  1
B78                  1
C70                  1
A32                  1
E58                  1
E38                  1
E77                  1
C54                  1
B39                  1
C95                  1
D7                   1
A5                   1
C148                 1
A14                  1
E63                  1
D15                  1
B79                  1
D46                  1
B69                  1
A6                   1
C7                   1
B86                  1
B101                 1
F E69                1
A36                  1
B4                   1
C128                 1
F G63                1
B19                  1
E31                  1
E10                  1
A10                  1
C30                  1
D48                  1
A31                  1
C118                 1
B50                  1
B37                  1
A34                  1
A20                  1
C49                  1
C91                  1
C101                 1
C106                 1
E34                  1
C111                 1
B30                  1
D11                  1
D45                  1
C86                  1
T                    1
D49                  1
D21                  1
B73                  1
D6                   1
B102                 1
E46                  1
B82 B84              1
A26                  1
A16                  1
C50                  1
B3                   1
C62 C64              1
B41                  1
C47                  1
E68                  1
B42                  1
F38                  1
B94                  1
Name: Cabin, dtype: int64
-------------
Embarked
-------------
S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64
-------------